api/spec/fixtures/moneyhash/transaction.purchase.successful.json

{
  "type": "transaction.purchase.successful",
  "status_id": "9z2l4n9",
  "operation_id": "94eK1qL",
  "intent": {
    "id": "LY0a5W9",
    "created": "2025-03-10 17:44:35.192694+00:00",
    "custom_fields": {
      "lago_mit": false,
      "lago_plan_id": "de95fd5d-3349-4439-a5d0-18b42b8551d1",
      "lago_mh_service": "Invoices::Payments::MoneyhashService",
      "lago_payable_id": "23fd1f3c-922c-4928-b40b-c8a31e4d6664",
      "lago_customer_id": "53c14b65-3406-4b1b-9d49-77fb389ee92e",
      "lago_payable_type": "Invoice",
      "lago_organization_id": "1f6edf98-9eb4-4baf-8c64-7c6be9d0b414",
      "lago_subscription_external_id": "69f64026-69eb-4836-b1bd-9323d9f7d892"
    },
    "split_data": [],
    "custom_form_answers": null,
    "amount": {
      "value": 7.1,
      "currency": "USD"
    },
    "flow_data": {
      "id": "xgXlXgX",
      "version": 1,
      "sequence": null
    },
    "payment_status": {
      "status": "CAPTURED",
      "balances": {
        "total_authorized": "7.10",
        "total_voided": "0.00",
        "available_to_void": "0.00",
        "total_captured": "7.10",
        "available_to_capture": "0.00",
        "total_refunded": "0.00",
        "available_to_refund": "7.10"
      }
    }
  },
  "account": {
    "id": "lgaxEBL"
  },
  "transaction": {
    "type": "payment",
    "id": "0f6d9298-5346-49e4-8043-f3899bedbdb1",
    "created": "2025-03-10 17:44:44.588034+00:00",
    "status": "purchase.successful",
    "billing_data": {
      "name": "Legal00x3 Customer",
      "first_name": "Legal00x3",
      "last_name": "Customer",
      "email": "test@mh.io",
      "phone_number": "+201087654321",
      "address": null,
      "address1": null,
      "apartment": null,
      "floor": null,
      "building": null,
      "street": null,
      "city": null,
      "state": null,
      "country": null,
      "postal_code": null,
      "mobile_wallet_number": null
    },
    "external_action_message": [],
    "provider_transaction_fields": {
      "checkoutdotcom_payment_id": null,
      "checkoutdotcom_payment_auth_code": null,
      "checkoutdotcom_increase_auth_code": null,
      "checkoutdotcom_increase_auth_action_id": null,
      "checkoutdotcom_acquirer_reference_number": null,
      "checkoutdotcom_processing_object": null,
      "checkoutdotcom_operation_fields": {}
    },
    "provider_unique_reference": {
      "key": "checkoutdotcom_payment_id",
      "value": null
    },
    "operations": [
      {
        "id": "94eK1qL",
        "type": "purchase",
        "status": "successful",
        "amount": {
          "value": 7.1,
          "currency": "USD"
        },
        "latest_status": {
          "id": "9z2l4n9",
          "value": "successful",
          "code": "6000",
          "provider_error_code": null,
          "provider_error_message": null,
          "message": "Successful",
          "localized_message": "Successful"
        },
        "statuses": [
          {
            "id": "gy2BVQZ",
            "value": "pending",
            "code": "8000",
            "provider_error_code": null,
            "provider_error_message": null,
            "message": "Pending",
            "localized_message": "Pending",
            "created": "2025-03-10 17:44:44.642478+00:00"
          },
          {
            "id": "9z2l4n9",
            "value": "successful",
            "code": "6000",
            "provider_error_code": null,
            "provider_error_message": null,
            "message": "Successful",
            "localized_message": "Successful",
            "created": "2025-03-10 17:44:44.778054+00:00"
          }
        ],
        "refund_type": null,
        "custom_fields": null,
        "extra": {},
        "rrn": null,
        "arn": null,
        "authorization_code": null
      }
    ],
    "fraud_decision": null,
    "device_check": null,
    "custom_message": "",
    "method": {
      "id": "gqYGvEg",
      "display_name": "CheckoutDotCom - Card",
      "service_provider": {
        "id": "gQJnWwZ",
        "display_name": "Checkout.com"
      }
    },
    "payment_method_details": {
      "type": "CARD",
      "data": null,
      "provider_data": null
    },
    "authentication_data": null,
    "paying_card_token": {
      "id": "419cb5f7-20fc-4571-a64d-4a64f0a0412f",
      "hashid": "gMRXKaZ",
      "brand": "Visa",
      "card_holder_name": "Kevin Smith",
      "bin": "111100",
      "last_4": "0000",
      "issuer": "test",
      "expiry_month": "02",
      "expiry_year": "26",
      "country": null,
      "type": null,
      "custom_fields": {
        "lago_mit": false,
        "lago_plan_id": "de95fd5d-3349-4439-a5d0-18b42b8551d1",
        "lago_mh_service": "Invoices::Payments::MoneyhashService",
        "lago_payable_id": "23fd1f3c-922c-4928-b40b-c8a31e4d6664",
        "lago_customer_id": "53c14b65-3406-4b1b-9d49-77fb389ee92e",
        "lago_payable_type": "Invoice",
        "lago_organization_id": "1f6edf98-9eb4-4baf-8c64-7c6be9d0b414",
        "lago_subscription_external_id": "69f64026-69eb-4836-b1bd-9323d9f7d892"
      },
      "provider_token_data": [
        {
          "last_4": "0000",
          "service_provider_id": "gQJnWwZ",
          "pay_in_method": "gqYGvEg",
          "provider_specific_data": {
            "token_id": "test_token"
          }
        }
      ],
      "requires_cvv": true,
      "fingerprint": "d795b7befe90eaf9d91a9d563f446487c69f06c3a35374289a385d40709a82f0b14ebe7c24139e19aaca6f3661ec1a3715d92e51a5b099880acb66b39a621dc5",
      "vault_region": "default"
    },
    "authorization_code": null,
    "merchant_reference": null,
    "shipping_data": null,
    "trx_rrn": null,
    "ip": {
      "ip_address": "196.150.203.149",
      "country": {
        "iso_code": "EG",
        "name": "Egypt"
      }
    },
    "full_capture": true
  },
  "api_version": "1.1"
}
